{
  "format": "graph-model",
  "generatedBy": "2.15.0",
  "convertedBy": "TensorFlow.js Converter v4.16.0",
  "signature": {
    "inputs": {
      "dense_input": {
        "name": "dense_input:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "-1" }, { "size": "5" }] }
      }
    },
    "outputs": {
      "dense_2": {
        "name": "Identity:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "-1" }, { "size": "23" }] }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "5" }, { "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }, { "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }, { "size": "23" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "23" }] }
            }
          }
        }
      },
      {
        "name": "dense_input",
        "op": "Placeholder",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "shape": { "shape": { "dim": [{ "size": "-1" }, { "size": "5" }] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense/Relu",
        "op": "_FusedMatMul",
        "input": [
          "dense_input",
          "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_a": { "b": false },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "transpose_b": { "b": false },
          "num_args": { "i": "1" },
          "T": { "type": "DT_FLOAT" },
          "leakyrelu_alpha": { "f": 0.2 },
          "epsilon": { "f": 0.0 }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_1/Relu",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/sequential/dense/Relu",
          "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "epsilon": { "f": 0.0 },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "transpose_b": { "b": false },
          "leakyrelu_alpha": { "f": 0.2 },
          "transpose_a": { "b": false },
          "T": { "type": "DT_FLOAT" },
          "num_args": { "i": "1" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_2/BiasAdd",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/sequential/dense_1/Relu",
          "StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA=="] } },
          "transpose_a": { "b": false },
          "epsilon": { "f": 0.0 },
          "transpose_b": { "b": false },
          "leakyrelu_alpha": { "f": 0.2 },
          "T": { "type": "DT_FLOAT" },
          "num_args": { "i": "1" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_2/Softmax",
        "op": "Softmax",
        "input": ["StatefulPartitionedCall/sequential/dense_2/BiasAdd"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "Identity",
        "op": "Identity",
        "input": ["StatefulPartitionedCall/sequential/dense_2/Softmax"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      }
    ],
    "library": {},
    "versions": { "producer": 1645 }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp",
          "shape": [5, 64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp",
          "shape": [64, 64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp",
          "shape": [64, 23],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp",
          "shape": [23],
          "dtype": "float32"
        }
      ]
    }
  ]
}
